
# 1. READ RTL
read_verilog ../rtl/verification_fabric_top.v

# 2. ELABORATE
hierarchy -check -top verification_fabric_top

# 3. BASIC SYNTHESIS (SAFE)
proc
opt
fsm
opt
memory
opt

# 4. TECH MAPPING (LIGHT)
techmap
opt

# 5. MAP TO SKY130
dfflibmap -liberty /home/harini/pdks/volare/sky130/versions/c6d73a35f524070e85faff4a6a9eef49553ebc2b/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

abc -liberty /home/harini/pdks/volare/sky130/versions/c6d73a35f524070e85faff4a6a9eef49553ebc2b/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

# 6. CLEAN
clean

# 7. REPORT
stat

# 8. OUTPUT
write_verilog verification_fabric_top_synth.v
