create_clock -name clk -period 10 -waveform {0 1} [get_ports "clk"]
set_clock_transition -rise 0.1 [get_clock "clk"]
set_clock_transition -fall 0.1 [get_clock "clk"]
set_clock_uncertainty 0.01 [get_ports "clk"]
set_input_delay -max 1.0 [get_ports "reset"] -clock [get_clock "clk"]
set_input_delay -max 1.0 [get_ports "x"] -clock [get_clock "clk"]
set_input_delay -max 1.0 [get_ports "a"] -clock [get_clock "clk"]
set_input_delay -max 1.0 [get_ports "b"] -clock [get_clock "clk"]
set_input_delay -max 1.0 [get_ports "c"] -clock [get_clock "clk"]
set_output_delay -max 1.0 [get_ports "y"]-clock [get_clock "clk"]
set_output_delay -max 1.0 [get_ports "v1"]-clock [get_clock "clk"]
set_output_delay -max 1.0 [get_ports "v2"]-clock [get_clock "clk"]
set_output_delay -max 1.0 [get_ports "v3"]-clock [get_clock "clk"]
set_output_delay -max 1.0 [get_ports "v4"]-clock [get_clock "clk"]
set_output_delay -max 1.0 [get_ports "v5"]-clock [get_clock "clk"]

