###############################################################################
# Created by write_sdc
# Wed Apr 15 02:00:07 2026
###############################################################################
current_design riscv_rv32i
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 30.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[0]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[10]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[11]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[12]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[13]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[14]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[15]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[16]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[17]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[18]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[19]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[1]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[20]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[21]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[22]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[23]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[24]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[25]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[26]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[27]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[28]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[29]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[2]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[30]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[31]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[3]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[4]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[5]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[6]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[7]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[8]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instr[9]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[0]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[10]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[11]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[12]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[13]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[14]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[15]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[16]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[17]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[18]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[19]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[1]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[20]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[21]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[22]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[23]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[24]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[25]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[26]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[27]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[28]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[29]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[2]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[30]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[31]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[3]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[4]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[5]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[6]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[7]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[8]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_result[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {alu_result[31]}]
set_load -pin_load 0.0334 [get_ports {alu_result[30]}]
set_load -pin_load 0.0334 [get_ports {alu_result[29]}]
set_load -pin_load 0.0334 [get_ports {alu_result[28]}]
set_load -pin_load 0.0334 [get_ports {alu_result[27]}]
set_load -pin_load 0.0334 [get_ports {alu_result[26]}]
set_load -pin_load 0.0334 [get_ports {alu_result[25]}]
set_load -pin_load 0.0334 [get_ports {alu_result[24]}]
set_load -pin_load 0.0334 [get_ports {alu_result[23]}]
set_load -pin_load 0.0334 [get_ports {alu_result[22]}]
set_load -pin_load 0.0334 [get_ports {alu_result[21]}]
set_load -pin_load 0.0334 [get_ports {alu_result[20]}]
set_load -pin_load 0.0334 [get_ports {alu_result[19]}]
set_load -pin_load 0.0334 [get_ports {alu_result[18]}]
set_load -pin_load 0.0334 [get_ports {alu_result[17]}]
set_load -pin_load 0.0334 [get_ports {alu_result[16]}]
set_load -pin_load 0.0334 [get_ports {alu_result[15]}]
set_load -pin_load 0.0334 [get_ports {alu_result[14]}]
set_load -pin_load 0.0334 [get_ports {alu_result[13]}]
set_load -pin_load 0.0334 [get_ports {alu_result[12]}]
set_load -pin_load 0.0334 [get_ports {alu_result[11]}]
set_load -pin_load 0.0334 [get_ports {alu_result[10]}]
set_load -pin_load 0.0334 [get_ports {alu_result[9]}]
set_load -pin_load 0.0334 [get_ports {alu_result[8]}]
set_load -pin_load 0.0334 [get_ports {alu_result[7]}]
set_load -pin_load 0.0334 [get_ports {alu_result[6]}]
set_load -pin_load 0.0334 [get_ports {alu_result[5]}]
set_load -pin_load 0.0334 [get_ports {alu_result[4]}]
set_load -pin_load 0.0334 [get_ports {alu_result[3]}]
set_load -pin_load 0.0334 [get_ports {alu_result[2]}]
set_load -pin_load 0.0334 [get_ports {alu_result[1]}]
set_load -pin_load 0.0334 [get_ports {alu_result[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
